{
  "intents": [
    {
      "tag": "date",
      "patterns": [
        "What is the date today",
        "What is the day today",
        "What's the day today",
        "What's the date today",
        "Tell me the current date",
        "Give me today's date"
      ],
      "responses": [""]
    },
    {
      "tag": "name",
      "patterns": [
        "What is your name",
        "what should I call you",
        "who are you",
        "can you tell me your name",
        "Do you have a name",
        "What do people call you",
        "Do you have a name"
      ],
      "responses": [
        "You can call me P-Bot. I am a deep-learning bot. Lovely to meet you!",
        "I am P-Bot. I am a deep-learning bot. Pleasure to meet you!",
        "My name is P-Bot. I am a deep-learning bot. Glad to meet you!"
      ]
    },
    {
      "tag": "personality",
      "patterns": ["What are you"],
      "responses": ["I'm P-Bot, your virtual assistant designed specifically to help you navigate through some aspects of the Polytechnic University of the Philippines (PUP) experience! While I strive to provide information, answer questions, and assist you with various PUP-related topics, please note that I may not have answers to every query. However, I'm here to do my best to help you with the information I have available. Whether you need directions, program details, or just want to chat, feel free to ask away!"]
    },
    {
      "tag": "greetings",
      "patterns": [
        "hi",
        "hey",
        "hello",
        "good day",
        "greetings",
        "what's up",
        "how is it going",
        "is anyone there"
      ],
      "responses": [
        "Hello! I am P-Bot, what can I do for you?",
        "Hey! I am P-bot, happy to be of assistance.",
        "Hi there, I am P-bot at your service. Tell me how I can help."
      ]
    },

    {
      "tag": "time",
      "patterns": [
        "What time is it?",
        "time right now",
        "do you know what time it is",
        "can you tell me the time",
        "what is the time",
        "Tell me the current time",
        "Give me the time now"
      ],
      "responses": [""]
    },

    {
      "tag": "dean",
      "patterns": [
        "who is the dean of the {dean}",
        "what is the name of the {dean} dean",
        "Tell me the dean of {dean} department",
        "Who holds the position of dean in {dean} department"
      ],
      "responses": [""]
    },

    {
      "tag": "ge",
      "patterns": [
        "List all grade equivalences",
        "What are the grade equivalences?",
        "Provide a list of grade equivalents",
        "Can you list the grade equivalences?"
      ],
      "responses": [
        ""
      ]
    },

    {
      "tag": "sge",
      "patterns": [
        "What is the percentage equivalent of grade",
        "What is the percentage equivalent of",
        "What is the grade equivalent of ",
        "What is the grade equivalence of ",
        "grade equivalent of",
        "grade equivalence of"
      ],
      "responses": [""]
    },
    {
      "tag": "programs",
      "patterns": [
        "What programs are offered",
        "What courses are available",
        "Tell me about the academic programs at PUP",
        "List of courses at Polytechnic University of the Philippines",
        "Can you share information about the available programs"
      ],
      "responses": [
        "To view the list of programs offered at the Polytechnic University of the Philippines, please visit the official website of the PUP campus: https://www.pup.edu.ph/academic/undergrad"
      ]
    },
    {
      "tag": "contacts",
      "patterns": [
        "Can you provide the contact information for {name}",
        "Can you give me the list of contact information for campus officials",
        "How can I contact PUP administration",
        "Tell me about the contact details of the officials at PUP",
        "Provide me with contact info for campus officials"
      ],
      "responses": [
        "To access the contact information for the officials of the Polytechnic University of the Philippines, please visit the official website of the PUP campus: https://www.pup.edu.ph/about/contactinformation"
      ]
    },
    {
      "tag": "handbook",
      "patterns": [
        "Can you provide the student handbook?",
        "Can you give me the student handbook?",
        "Provide me with the student handbook",
        "Where can I find the student handbook?",
        "Is there a handbook for students?",
        "Tell me about the PUP student handbook"
      ],
      "responses": [
        "To view the student handbook (2014 revised edition), please visit: https://www.pup.edu.ph/studentservices/files/thepupstudenthandbook2014.pdf"
      ]
    },
    {
      "tag": "ords",
      "patterns": [
        "How do I request a document from the registrar",
        "What is the process for document request in the registrar",
        "Tell me the procedure for document request at the registrar's office.",
        "I need to obtain a document. What's the process with the registrar",
        "Can you guide me through the document request process in the registrar's office"
      ],
      "responses": [
        "To initiate a document request, go to the official Online Document Request System (ODRS) site at https://odrs.pup.edu.ph/. Upon reaching the site, select your registrar from the available options. Afterward, either log in to your existing account or create one if you do not have any. Finally, proceed to make a request for the desired document."
      ]
    },
    {
      "tag": "appointment",
      "patterns": [
        "How do I request an appointment",
        "What is the process for scheduling an appointment",
        "Can you guide me on how to request an appointment",
        "I need to set up a meeting. How can I make an appointment",
        "Tell me the steps to book an appointment through the official system.",
        "Is there a specific way to schedule appointments online"
      ],
      "responses": [
        "To request an appointment, go to the official Appointment System at https://apps.pup.edu.ph/appointment/."
      ]
    }
  ]
}
